% 位置速度动力学方程
function y = dynfuncJ2(x)
y(1:3) = x(4:6);
r = norm(x(1:3));
J2 = 0.00108262668355315;
GEarth = 398600.4418;
Re = 6378.137;
%% 仅J2项
y(4) = -GEarth*x(1)/r^3*( 1 + 1.5*J2*(Re/r)^2*(1-5*(x(3)/r)^2) );
y(5) = y(4)*x(2)/x(1);
y(6) = -GEarth*x(3)/r^3*( 1 + 1.5*J2*(Re/r)^2*(3-5*(x(3)/r)^2) );

%% 仅J2项
% y(4) = -GEarth*x(1)/r^3*( 1 + 1.5*J2*(Re/r)^2*(1-5*(x(3)/r)^2) );
% y(5) = y(4)*x(2)/x(1);
% y(6) = -GEarth*x(3)/r^3*( 1 + 1.5*J2*(Re/r)^2*(3-5*(x(3)/r)^2) );
% y(7) = 0;
% y(8) = 0;

%% J2+大气阻力
% air = [-We*x(2), We*x(1), 0]';
% RelVel = (x(4:6) - air)*1000;
% aair = ( -0.5* 6*1e-14 * norm(RelVel) )*RelVel/1000;
% y(4) = -GEarth*x(1)/r^3*( 1 + 1.5*J2*(Re/r)^2*(1-5*(x(3)/r)^2) ) + aair(1);
% y(5) = y(4)*x(2)/x(1) + aair(2);
% y(6) = -GEarth*x(3)/r^3*( 1 + 1.5*J2*(Re/r)^2*(3-5*(x(3)/r)^2) ) + aair(3);
% % y(7) = 0;

%% 输出列向量
y = y';